andrewechang/cownect/firmware-collar-simple/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# ESP32-S3-WROOM-1-N16R8: 16 MB flash, 8 MB octal PSRAM
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y

# Bigger main task stack (the capture loop and Wi-Fi run in app_main)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
